document.addEventListener("DOMContentLoaded", function () {
  const priceMap = {
    "iPhone 8": {
      64: {
        Пошкоджений: "1000",
        Хороший: "1800",
        "Як новий": "2500",
      },
      256: {
        Пошкоджений: "1300",
        Хороший: "2600",
        "Як новий": "3700",
      },
    },
    "iPhone 8 Plus": {
      64: {
        Пошкоджений: "1800",
        Хороший: "3700",
        "Як новий": "4800",
      },
      256: {
        Пошкоджений: "2000",
        Хороший: "4400",
        "Як новий": "5500",
      },
    },
    "iPhone Xr": {
      64: {
        Пошкоджений: "2300",
        Хороший: "5700",
        "Як новий": "6900",
      },
      128: {
        Пошкоджений: "3000",
        Хороший: "6700",
        "Як новий": "7800",
      },
      256: {
        Пошкоджений: "3300",
        Хороший: "7200",
        "Як новий": "8300",
      },
    },
    "iPhone X": {
      64: {
        Пошкоджений: "2500",
        Хороший: "4800",
        "Як новий": "5800",
      },
      256: {
        Пошкоджений: "2700",
        Хороший: "5500",
        "Як новий": "6700",
      },
    },
    "iPhone Xs": {
      64: {
        Пошкоджений: "2500",
        Хороший: "5600",
        "Як новий": "6700",
      },
      256: {
        Пошкоджений: "2700",
        Хороший: "6300",
        "Як новий": "7400",
      },
      512: {
        Пошкоджений: "3500",
        Хороший: "7000",
        "Як новий": "8200",
      },
    },
    "iPhone Xs Max": {
      64: {
        Пошкоджений: "3700",
        Хороший: "7400",
        "Як новий": "8500",
      },
      256: {
        Пошкоджений: "3900",
        Хороший: "8500",
        "Як новий": "9600",
      },
      512: {
        Пошкоджений: "4600",
        Хороший: "9300",
        "Як новий": "10400",
      },
    },
    "iPhone 11": {
      64: {
        Пошкоджений: "3800",
        Хороший: "8200",
        "Як новий": "9300",
      },
      128: {
        Пошкоджений: "4700",
        Хороший: "10000",
        "Як новий": "11000",
      },
      256: {
        Пошкоджений: "5200",
        Хороший: "10800",
        "Як новий": "11900",
      },
    },
    "iPhone 11 Pro": {
      64: {
        Пошкоджений: "4600",
        Хороший: "9200",
        "Як новий": "10500",
      },
      256: {
        Пошкоджений: "5700",
        Хороший: "11900",
        "Як новий": "13000",
      },
      512: {
        Пошкоджений: "6700",
        Хороший: "13400",
        "Як новий": "14500",
      },
    },
    "iPhone 11 Pro Max": {
      64: {
        Пошкоджений: "5200",
        Хороший: "10500",
        "Як новий": "12300",
      },
      256: {
        Пошкоджений: "6500",
        Хороший: "13000",
        "Як новий": "14900",
      },
      512: {
        Пошкоджений: "6900",
        Хороший: "13800",
        "Як новий": "15600",
      },
    },
    "iPhone 12 mini": {
      64: {
        Пошкоджений: "4100",
        Хороший: "8200",
        "Як новий": "10000",
      },
      128: {
        Пошкоджений: "5000",
        Хороший: "10000",
        "Як новий": "11900",
      },
      256: {
        Пошкоджений: "5400",
        Хороший: "10800",
        "Як новий": "12600",
      },
    },
    "iPhone 12": {
      64: {
        Пошкоджений: "5500",
        Хороший: "11200",
        "Як новий": "13000",
      },
      128: {
        Пошкоджений: "6100",
        Хороший: "12300",
        "Як новий": "14100",
      },
      256: {
        Пошкоджений: "6700",
        Хороший: "13400",
        "Як новий": "15300",
      },
    },
    "iPhone 12 Pro": {
      64: {
        Пошкоджений: "8000",
        Хороший: "16000",
        "Як новий": "17900",
      },
      128: {
        Пошкоджений: "8700",
        Хороший: "17500",
        "Як новий": "19300",
      },
      256: {
        Пошкоджений: "9300",
        Хороший: "18600",
        "Як новий": "20500",
      },
    },
    "iPhone 12 Pro Max": {
      64: {
        Пошкоджений: "9300",
        Хороший: "18600",
        "Як новий": "20500",
      },
      256: {
        Пошкоджений: "1000",
        Хороший: "20100",
        "Як новий": "22000",
      },
      512: {
        Пошкоджений: "10600",
        Хороший: "21200",
        "Як новий": "23100",
      },
    },
    "iPhone 13 mini": {
      128: {
        Пошкоджений: "7200",
        Хороший: "14500",
        "Як новий": "16400",
      },
      256: {
        Пошкоджений: "8200",
        Хороший: "16400",
        "Як новий": "18200",
      },
      512: {
        Пошкоджений: "8700",
        Хороший: "17500",
        "Як новий": "19400",
      },
    },
    "iPhone 13": {
      128: {
        Пошкоджений: "9100",
        Хороший: "18200",
        "Як новий": "20100",
      },
      256: {
        Пошкоджений: "9600",
        Хороший: "19300",
        "Як новий": "21200",
      },
      512: {
        Пошкоджений: "10400",
        Хороший: "20800",
        "Як новий": "22700",
      },
    },
    "iPhone 13 Pro": {
      128: {
        Пошкоджений: "12300",
        Хороший: "24900",
        "Як новий": "26800",
      },
      256: {
        Пошкоджений: "13400",
        Хороший: "26800",
        "Як новий": "28700",
      },
      512: {
        Пошкоджений: "13700",
        Хороший: "27900",
        "Як новий": "29800",
      },
    },
    "iPhone 13 Pro Max": {
      128: {
        Пошкоджений: "13300",
        Хороший: "27200",
        "Як новий": "29000",
      },
      256: {
        Пошкоджений: "14200",
        Хороший: "29000",
        "Як новий": "30900",
      },
      512: {
        Пошкоджений: "14900",
        Хороший: "28900",
        "Як новий": "31700",
      },
    },
    "iPhone 14": {
      128: {
        Пошкоджений: "11000",
        Хороший: "22000",
        "Як новий": "23800",
      },
      256: {
        Пошкоджений: "11500",
        Хороший: "23200",
        "Як новий": "24900",
      },
      512: {
        Пошкоджений: "12400",
        Хороший: "24900",
        "Як новий": "26800",
      },
    },
    "iPhone 14 Plus": {
      128: {
        Пошкоджений: "11700",
        Хороший: "23400",
        "Як новий": "25300",
      },
      256: {
        Пошкоджений: "12100",
        Хороший: "24200",
        "Як новий": "26100",
      },
      512: {
        Пошкоджений: "12600",
        Хороший: "25300",
        "Як новий": "27300",
      },
    },
    "iPhone 14 Pro": {
      128: {
        Пошкоджений: "15800",
        Хороший: "31700",
        "Як новий": "33500",
      },
      256: {
        Пошкоджений: "16600",
        Хороший: "33500",
        "Як новий": "35400",
      },
      512: {
        Пошкоджений: "17700",
        Хороший: "35500",
        "Як новий": "37300",
      },
    },
    "iPhone 14 Pro Max": {
      128: {
        Пошкоджений: "17100",
        Хороший: "33500",
        "Як новий": "35400",
      },
      256: {
        Пошкоджений: "17700",
        Хороший: "35400",
        "Як новий": "37300",
      },
      512: {
        Пошкоджений: "19500",
        Хороший: "39100",
        "Як новий": "41000",
      },
    },
  };

  function updateDescription(status) {
    const descriptions = document.querySelectorAll(
      ".description-text1, .description-text2, .description-text3"
    );
    descriptions.forEach((desc) => (desc.style.display = "none"));

    if (status === "Пошкоджений") {
      document.querySelector(".description-text1").style.display = "block";
    } else if (status === "Хороший") {
      document.querySelector(".description-text2").style.display = "block";
    } else if (status === "Як новий") {
      document.querySelector(".description-text3").style.display = "block";
    }
  }

  function updateInfo() {
    const model = document.getElementById("model").value;
    const memoryValue = document.querySelector(
      'input[name="radio"]:checked'
    ).value;
    const statusValue = document
      .querySelector(".status.active")
      .getAttribute("value");

    const priceValue = priceMap[model][memoryValue][statusValue];

    document.getElementById("selectedModel").value = model;
    document.getElementById("selectedMemory").value = memoryValue;
    document.getElementById("selectedStatus").value = statusValue;
    document.getElementById("totalPrice").value = priceValue;
  }

  const memoryRadios = document.querySelectorAll('input[name="radio"]');
  memoryRadios.forEach((radio) => {
    radio.addEventListener("change", function () {
      updateInfo();
    });
  });

  const statusButtons = document.querySelectorAll(".status");
  statusButtons.forEach((btn) => {
    btn.addEventListener("click", function () {
      statusButtons.forEach((b) => b.classList.remove("active"));
      btn.classList.add("active");
      updateDescription(this.value);
      updateInfo();
    });
  });

  document.getElementById("model").addEventListener("change", updateInfo);
});
